kilojoules-kj/EE2028-STM32/Core/Src/main.c
	HAL_ADC_Init(&ADC_HandlerLightSensor);

	// Calibrate once after init
	HAL_ADCEx_Calibration_Start(&ADC_HandlerLightSensor, ADC_SINGLE_ENDED);

	// 3) Channel config — ***pick the channel that matches A0***
	ADC_ChannelConfTypeDef Config = {0};
	Config.Channel      = ADC_CHANNEL_14;                 // PC5 → IN14
	Config.Rank         = ADC_REGULAR_RANK_1;
	Config.SamplingTime = ADC_SAMPLETIME_247CYCLES_5;     // long sample (LDR divider)
	Config.SingleDiff   = ADC_SINGLE_ENDED;
	Config.OffsetNumber = ADC_OFFSET_NONE;
	Config.Offset       = 0;
	HAL_ADC_ConfigChannel(&ADC_HandlerLightSensor, &Config); */

	/* --- I2C1 GPIO ---
	 * ARD_D15_Pin GPIO_PIN_8 // PB8 -> I2C1_SCL
	 * ARD_D15_GPIO_Port GPIOB
	 * ARD_D14_Pin GPIO_PIN_9 // PB9 -> I2C1_SDA
	 * ARD_D14_GPIO_Port GPIOB */
	__HAL_RCC_I2C1_CLK_ENABLE();
	GPIO_InitTypeDef GPIO_InitStructI2C1 = {0};
	GPIO_InitStructI2C1.Pin       = ARD_D15_Pin | ARD_D14_Pin;
	GPIO_InitStructI2C1.Mode      = GPIO_MODE_AF_OD;          // open-drain for I2C
	GPIO_InitStructI2C1.Pull      = GPIO_PULLUP;              // needs pull-ups
	GPIO_InitStructI2C1.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStructI2C1.Alternate = GPIO_AF4_I2C1;            // AF4 on L4
	HAL_GPIO_Init(ARD_D14_GPIO_Port, &GPIO_InitStructI2C1);
	/* --- I2C1 Config --- */
	hi2c1.Instance = I2C1;
	hi2c1.Init.Timing = 0x00320F13; // TIMINGR = (PRESC<<28) | (SCLDEL<<20) | (SDADEL<<16) | (SCLH<<8) | SCLL
	hi2c1.Init.OwnAddress1 = 0;
	hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	hi2c1.Init.OwnAddress2 = 0;
	hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE; // Master sends a signal to all I2C devices
	hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE; // Disabling so slow slave to hold the clock line low to extend the clock pulse duration, giving it more time to process data.
	HAL_I2C_Init(&hi2c1);

	/* --- I2C2 GPIO ---
	 * INTERNAL_I2C2_SCL_Pin GPIO_PIN_10
	 * INTERNAL_I2C2_SCL_GPIO_Port GPIOB
	 * INTERNAL_I2C2_SDA_Pin GPIO_PIN_11
	 * INTERNAL_I2C2_SDA_GPIO_Port GPIOB */
	__HAL_RCC_I2C2_CLK_ENABLE();
	GPIO_InitTypeDef GPIO_InitStructI2C2 = {0};
	GPIO_InitStructI2C2.Pin       = INTERNAL_I2C2_SCL_Pin | INTERNAL_I2C2_SDA_Pin;
	GPIO_InitStructI2C2.Mode      = GPIO_MODE_AF_OD;          // open-drain for I2C
	GPIO_InitStructI2C2.Pull      = GPIO_PULLUP;              // needs pull-ups
	GPIO_InitStructI2C2.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStructI2C2.Alternate = GPIO_AF4_I2C2;            // AF4 on L4
	HAL_GPIO_Init(INTERNAL_I2C2_SCL_GPIO_Port, &GPIO_InitStructI2C2);
	/* --- I2C2 Config --- */
	hi2c2.Instance = I2C2;
	hi2c2.Init.Timing = 0x00320F13; // TIMINGR = (PRESC<<28) | (SCLDEL<<20) | (SDADEL<<16) | (SCLH<<8) | SCLL
	hi2c2.Init.OwnAddress1 = 0;
	hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	hi2c2.Init.OwnAddress2 = 0;
	hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE; // Master sends a signal to all I2C devices
	hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE; // Disabling so slow slave to hold the clock line low to extend the clock pulse duration, giving it more time to process data.
	HAL_I2C_Init(&hi2c2);

	/* --- NFC GPO pin (interrupt from ST25DV) ---
	 * ST25DV04K_GPO_Pin GPIO_PIN_4
	 * ST25DV04K_GPO_GPIO_Port GPIOE*/
	GPIO_InitTypeDef GPIO_InitStructGPO = {0};
	GPIO_InitStructGPO.Pin = ST25DV04K_GPO_Pin;
	GPIO_InitStructGPO.Mode = GPIO_MODE_IT_FALLING;   // GPO often active-low pulses
	GPIO_InitStructGPO.Pull = GPIO_PULLUP;            // depends on board; pull-up is usually correct
	HAL_GPIO_Init(ST25DV04K_GPO_GPIO_Port, &GPIO_InitStructGPO);

	/* --- NVIC EXTI Interrupt --- */
	//__HAL_GPIO_EXTI_CLEAR_IT(BUTTON_EXTI13_Pin);
	//__HAL_GPIO_EXTI_CLEAR_IT(ST25DV04K_GPO_Pin);
	// Enable NVIC EXTI line 0 - 15
	HAL_NVIC_SetPriority(EXTI15_10_IRQn, 2, 0);
	HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
	HAL_NVIC_SetPriority(EXTI4_IRQn, 1, 0);
	HAL_NVIC_EnableIRQ(EXTI4_IRQn);
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
	if (GPIO_Pin == ST25DV04K_GPO_Pin) {
		uint32_t now = HAL_GetTick();
		if (now - g_nfc_last_irq_ms < 100) return;   // debounce
		g_nfc_last_irq_ms = now;

		uint8_t dyn = 0;
		if (BSP_NFCTAG_ReadITSTStatus_Dyn(0, &dyn) != NFCTAG_OK) return; // <-- READ IT STATUS (clears)

		g_nfc_it_flags |= dyn;                      // pass bits to main loop

		if (dyn & NFCTAG_IT_FIELDRISING)  g_nfc_rf_state = 1; // RF ON
		if (dyn & NFCTAG_IT_FIELDFALLING) g_nfc_rf_state = 0; // RF OFF
	}


	if(GPIO_Pin == BUTTON_EXTI13_Pin) {
	    HAL_UART_Transmit(&huart1, (uint8_t*)"Blue button is pressed\r\n", sizeof("Blue button is pressed\r\n") - 1, 100);

		if (buttonActive == false) {
			buttonActive = true;
			buttonPressTime = HAL_GetTick();
		} else if (HAL_GetTick()-buttonPressTime > BUTTON_DURATION) {
			buttonActive = false;
		} else {
			buttonActive = false;
			toggleState();
		}


		if (nearbyFlag) {
			if (isPlayer) {
			    HAL_UART_Transmit(&huart1, (uint8_t*)"Player escaped, good job!\r\n", sizeof("Player escaped, good job!\r\n") - 1, 100);
			} else {
			    HAL_UART_Transmit(&huart1, (uint8_t*)"Player captured, good job!\r\n", sizeof("Player captured, good job!\r\n") - 1, 100);
			}
			nearbyFlag = false;
		}
	}
}

static void I2C_Scan(I2C_HandleTypeDef *hi2c, const char *tag) {
  char m[64];
  int n = sprintf(m, "\r\n--- %s ---\r\n", tag);
  HAL_UART_Transmit(&huart1,(uint8_t*)m,n,0xFFFF);
  for (uint8_t a=1; a<0x7F; a++) {
    if (HAL_I2C_IsDeviceReady(hi2c, a<<1, 2, 5)==HAL_OK) {
      n = sprintf(m, "I2C ACK @ 0x%02X\r\n", a);
      HAL_UART_Transmit(&huart1,(uint8_t*)m,n,0xFFFF);
    }
  }
}

void rf_poll_debug(void) {
    uint8_t rf_on = 0;
    if (BSP_NFCTAG_GetRFField_Dyn(0, &rf_on) == NFCTAG_OK) {
        if (rf_on) HAL_UART_Transmit(&huart1,(uint8_t*)"RF=ON\r\n",7,100);
    }
}

// Helper Methods
float TemperatureSensorHelper(bool output) {
	float tempData = BSP_TSENSOR_ReadTemp();

	if (output) {
		char tempMessage[32];
		sprintf(tempMessage, "Temp = %.2f deg C \r\n" , tempData);
		HAL_UART_Transmit(&huart1, (uint8_t*)tempMessage, strlen(tempMessage), 0xFFFF);
	}

