kilojoules-kj/EE2028-STM32/Core/Src/main.c
	return tempData;
}

float PressureSensorHelper(bool output) {
	float pressureData = BSP_PSENSOR_ReadPressure();

	if (output) {
		char pressureMessage[32];
		sprintf(pressureMessage, "Pressure = %.2f \r\n" , pressureData);
		HAL_UART_Transmit(&huart1, (uint8_t*)pressureMessage, strlen(pressureMessage), 0xFFFF);
	}

	return pressureData;
}

float HumiditySensorHelper(bool output) {
	float humidityData = BSP_HSENSOR_ReadHumidity();

	if (output) {
		char humidityMessage[32];
		sprintf(humidityMessage, "Humidity = %.2f \r\n" , humidityData);
		HAL_UART_Transmit(&huart1, (uint8_t*)humidityMessage, strlen(humidityMessage), 0xFFFF);
	}

	return humidityData;
}

float AccelerometerHelper(float* buffer) {
	int16_t accel_data_i16[3] = {0}; // create array of size [3] with values {0} to store xyz reading
	BSP_ACCELERO_AccGetXYZ(accel_data_i16); // returns 16 bit integers which are acceleration in mg (9.8/1000 m/s^2).

	for (int i = 0; i < 3; i++) {
		buffer[i] = (float)accel_data_i16[i] * (9.8/1000.0f); // mg -> m/s²
	}
	buffer[3] = sqrtf(buffer[0]*buffer[0] + buffer[1]*buffer[1] + buffer[2]*buffer[2]);

	char message_print[64];
	sprintf(message_print, "Accel: X: %.2f m/s², Y: %.2f m/s², Z: %.2f m/s², aggregated= %.2f m/s²\r\n", buffer[0], buffer[1], buffer[2], buffer[3]);
	HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);

	return buffer[3];
}

#define MOVING_AVG_SIZE 10  // number of samples for smoothing
float GyroscopeHelper(float* buffer) {
	static float gyroBuffer[3][MOVING_AVG_SIZE] = {0}; // buffers for X, Y, Z
	static int index = 0;                              // circular buffer index
	static int count = 0;                              // number of valid samples
	int16_t gyro_data_i16[3] = {0};
	float gyroData[3];

	BSP_GYRO_GetXYZ(gyro_data_i16);

	// Convert to deg/s
	for (int i = 0; i < 3; i++) {
		gyroData[i] = (float)gyro_data_i16[i] / 1000.0f;
		gyroBuffer[i][index] = gyroData[i];
	}

	// Update circular buffer
	index = (index + 1) % MOVING_AVG_SIZE;
	if (count < MOVING_AVG_SIZE) count++;

	// Compute moving average
	for (int i = 0; i < 3; i++) {
		float sum = 0.0f;
		for (int j = 0; j < count; j++) {
			sum += gyroBuffer[i][j];
		}
		buffer[i] = sum / count;
	}

	// Compute smoothed magnitude
	buffer[3] = sqrtf(buffer[0]*buffer[0] + buffer[1]*buffer[1] + buffer[2]*buffer[2]);

	// Print smoothed data
	char message_print[128];
	sprintf(message_print,
			"Gyro (avg %d): X: %.2f deg/s, Y: %.2f deg/s, Z: %.2f deg/s, magnitude= %.2f deg/s\r\n",
			count, buffer[0], buffer[1], buffer[2], buffer[3]);
	HAL_UART_Transmit(&huart1, (uint8_t*)message_print, strlen(message_print), 0xFFFF);

	return buffer[3];
}

float MagnetometerHelper(float* buffer) {
    int16_t magRaw[3] = {0};
    BSP_MAGNETO_GetXYZ(magRaw);   // raw LSB data from sensor

    const float MAG_SENSITIVITY = 0.15f;  // µT/LSB for LIS3MDL at ±4 gauss
    for (int i = 0; i < 3; i++) {
        buffer[i] = (float)magRaw[i] * MAG_SENSITIVITY;
    }

    // Compute magnitude (total field strength)
    buffer[3] = sqrtf(buffer[0]*buffer[0] + buffer[1]*buffer[1] + buffer[2]*buffer[2]);

    char message_print[80];
    sprintf(message_print, "Magnetic Field (µT): X=%.2f, Y=%.2f, Z=%.2f, |B|=%.2f\r\n", buffer[0], buffer[1], buffer[2], buffer[3]);
    //HAL_UART_Transmit(&huart1, (uint8_t*)message_print, strlen(message_print), 0xFFFF);

    return buffer[3];
}

void EnforcerOutput(void) {
    HAL_UART_Transmit(&huart1, (uint8_t*)"Player Out!\r\n", sizeof("Player Out!\r\n") - 1, 100);
}

void LEDBlinkHelper(int modulo) {
	if (HAL_GetTick() % modulo <= 10) {
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_14);
	}
}

uint16_t ReadLightSensorRaw(void) {
    HAL_ADC_Start(&ADC_HandlerLightSensor);
    HAL_ADC_PollForConversion(&ADC_HandlerLightSensor, 10);
    uint16_t val = (uint16_t)HAL_ADC_GetValue(&ADC_HandlerLightSensor);
    HAL_ADC_Stop(&ADC_HandlerLightSensor);
    return val; // 0..4095 for 12-bit
}

void OLED_ON(void) {
    uint8_t buf[] = {0x00, 0xAF};
    HAL_I2C_Master_Transmit(&hi2c1, SSD1308_ADDR, buf, sizeof(buf), 100 /*ms timeout*/);
}

static HAL_StatusTypeDef oled_write_data(const uint8_t *data, uint16_t len) {
    // We prepend the data control byte (0x40)
    // For large transfers, you can chunk it; this small helper sends in one go if len is modest.
    HAL_StatusTypeDef st;
    // stack-friendly small chunking
    uint16_t offset = 0;
    while (offset < len) {
        uint16_t chunk = (len - offset);
        if (chunk > 16) chunk = 16; // conservative chunk to avoid big I2C bursts
        uint8_t buf[1 + 16];
        buf[0] = 0x40;
        memcpy(&buf[1], &data[offset], chunk);
        st = HAL_I2C_Master_Transmit(&hi2c1, (uint16_t)SSD1308_ADDR, buf, (uint16_t)(1 + chunk), 100 /* I2C_TIMEOUT_MS */);
        if (st != HAL_OK) return st;
        offset += chunk;
    }
    return HAL_OK;
}
static HAL_StatusTypeDef oled_write_cmd(uint8_t cmd) {
    uint8_t b[2] = {0x00, cmd };
    return HAL_I2C_Master_Transmit(&hi2c1, (uint16_t)SSD1308_ADDR, b, sizeof(b), 100 /* I2C_TIMEOUT_MS */);
}

static HAL_StatusTypeDef oled_write_cmd2(uint8_t cmd0, uint8_t cmd1) {
    uint8_t b[3] = {0x00, cmd0, cmd1 };
    return HAL_I2C_Master_Transmit(&hi2c1, (uint16_t)SSD1308_ADDR, b, sizeof(b), 100 /* I2C_TIMEOUT_MS */);
}

static HAL_StatusTypeDef oled_clear() {
    HAL_StatusTypeDef st;

    // Make sure it shows RAM (not forced all-pixels-on) and normal polarity
    if ((st = oled_write_cmd(0xA4)) != HAL_OK) return st; // Resume RAM content display
    if ((st = oled_write_cmd(0xA6)) != HAL_OK) return st; // Normal (not inverted)

    // Horizontal addressing; full window
    if ((st = oled_write_cmd2(0x20, 0x00)) != HAL_OK) return st; // Addressing mode = horizontal
    if ((st = oled_write_cmd2(0x21, 0x00)) != HAL_OK) return st; // Column start
    if ((st = oled_write_cmd(127)) != HAL_OK) return st;         // Column end (0..127)
    if ((st = oled_write_cmd2(0x22, 0x00)) != HAL_OK) return st; // Page start
    if ((st = oled_write_cmd(7)) != HAL_OK) return st;           // Page end (0..7 for 64px)

    // Stream zeros across the whole screen: 128 cols × 8 pages = 1024 bytes
    uint8_t zeros[16] = {0};  // small chunk buffer
    for (int i = 0; i < (128 * 8) / (int)sizeof(zeros); i++) {
        st = oled_write_data(zeros, sizeof(zeros));  // prepends 0x40 inside helper
        if (st != HAL_OK) return st;
    }
    return HAL_OK;
}

static uint8_t g_fb[SSD1308_WIDTH * (SSD1308_HEIGHT/8)];   // 1,024 bytes
static const uint8_t font5x7[][5] = {
    // ' ' (32)
    {0x00,0x00,0x00,0x00,0x00},
    // '0'..'9' (48..57)
    {0x3E,0x51,0x49,0x45,0x3E}, // '0'
    {0x00,0x42,0x7F,0x40,0x00}, // '1'
    {0x42,0x61,0x51,0x49,0x46}, // '2'
    {0x21,0x41,0x45,0x4B,0x31}, // '3'
    {0x18,0x14,0x12,0x7F,0x10}, // '4'
    {0x27,0x45,0x45,0x45,0x39}, // '5'
    {0x3C,0x4A,0x49,0x49,0x30}, // '6'
    {0x01,0x71,0x09,0x05,0x03}, // '7'
    {0x36,0x49,0x49,0x49,0x36}, // '8'
    {0x06,0x49,0x49,0x29,0x1E}, // '9'
    // 'A'..'Z' (65..90)
    {0x7E,0x11,0x11,0x11,0x7E}, // 'A'
    {0x7F,0x49,0x49,0x49,0x36}, // 'B'
    {0x3E,0x41,0x41,0x41,0x22}, // 'C'
    {0x7F,0x41,0x41,0x22,0x1C}, // 'D'
    {0x7F,0x49,0x49,0x49,0x41}, // 'E'
    {0x7F,0x09,0x09,0x09,0x01}, // 'F'
    {0x3E,0x41,0x49,0x49,0x7A}, // 'G'
    {0x7F,0x08,0x08,0x08,0x7F}, // 'H'
    {0x00,0x41,0x7F,0x41,0x00}, // 'I'
    {0x20,0x40,0x41,0x3F,0x01}, // 'J'
    {0x7F,0x08,0x14,0x22,0x41}, // 'K'
    {0x7F,0x40,0x40,0x40,0x40}, // 'L'
    {0x7F,0x02,0x0C,0x02,0x7F}, // 'M'
    {0x7F,0x04,0x08,0x10,0x7F}, // 'N'
    {0x3E,0x41,0x41,0x41,0x3E}, // 'O'
    {0x7F,0x09,0x09,0x09,0x06}, // 'P'
    {0x3E,0x41,0x51,0x21,0x5E}, // 'Q'
    {0x7F,0x09,0x19,0x29,0x46}, // 'R'
    {0x46,0x49,0x49,0x49,0x31}, // 'S'
    {0x01,0x01,0x7F,0x01,0x01}, // 'T'
    {0x3F,0x40,0x40,0x40,0x3F}, // 'U'
    {0x1F,0x20,0x40,0x20,0x1F}, // 'V'
    {0x7F,0x20,0x18,0x20,0x7F}, // 'W'
    {0x63,0x14,0x08,0x14,0x63}, // 'X'
    {0x07,0x08,0x70,0x08,0x07}, // 'Y'
    {0x61,0x51,0x49,0x45,0x43}, // 'Z'
    // '-' '.' ':'
    {0x08,0x08,0x08,0x08,0x08}, // '-'
    {0x00,0x60,0x60,0x00,0x00}, // '.'
    {0x00,0x36,0x36,0x00,0x00}, // ':'
};
