kilojoules-kj/EE2028-STM32/Core/Src/main.c
static inline const uint8_t* glyph_for(char c) {
    if (c == ' ') return font5x7[0];
    if (c >= '0' && c <= '9') return font5x7[1 + (c - '0')];
    if (c >= 'A' && c <= 'Z') return font5x7[11 + (c - 'A')];
    if (c == '-') return font5x7[11 + 26];
    if (c == '.') return font5x7[11 + 27];
    if (c == ':') return font5x7[11 + 28];
    // Fallback: blank
    return font5x7[0];
}
static void fb_set_pixel(int x, int y, int on) {
    if (x < 0 || x >= SSD1308_WIDTH || y < 0 || y >= SSD1308_HEIGHT) return;
    int page = y >> 3;
    uint8_t bit = 1u << (y & 7);
    uint8_t *b = &g_fb[page * SSD1308_WIDTH + x];
    if (on) *b |= bit;
    else    *b &= (uint8_t)~bit;
}

static void fb_clear(void) {
    memset(g_fb, 0x00, sizeof(g_fb));
}

// Draw a 5x7 glyph with 1px spacing; returns advance (6 px)
static int fb_draw_char(int x, int y, char c) {
    const uint8_t *g = glyph_for(c);
    for (int col = 0; col < 5; col++) {
        uint8_t colbits = g[col]; // bit0 = top pixel
        for (int row = 0; row < 7; row++) {
            int on = (colbits >> row) & 1;
            fb_set_pixel(x + col, y + row, on);
        }
    }
    // 1 column spacing
    for (int row = 0; row < 7; row++) fb_set_pixel(x + 5, y + row, 0);
    return 6;
}
static void fb_draw_text(int x, int y, const char *s) {
    int cx = x;
    while (*s) {
        if (*s == '\n') { y += 8; cx = x; s++; continue; }
        cx += fb_draw_char(cx, y, *s++);
        if (cx > SSD1308_WIDTH - 6) { y += 8; cx = x; } // wrap to next row
        if (y > SSD1308_HEIGHT - 8) break;
    }
}
static HAL_StatusTypeDef oled_flush_full(void) {
    HAL_StatusTypeDef st;
    // Follow RAM & normal polarity (safety)
    if ((st = oled_write_cmd(0xA4)) != HAL_OK) return st;
    if ((st = oled_write_cmd(0xA6)) != HAL_OK) return st;
    // Horizontal addressing; full window
    if ((st = oled_write_cmd2(0x20, 0x00)) != HAL_OK) return st; // horizontal
    if ((st = oled_write_cmd2(0x21, 0x00)) != HAL_OK) return st; // col start
    if ((st = oled_write_cmd(SSD1308_WIDTH - 1)) != HAL_OK) return st;  // col end
    if ((st = oled_write_cmd2(0x22, 0x00)) != HAL_OK) return st; // page start
    if ((st = oled_write_cmd((SSD1308_WIDTH/8) - 1)) != HAL_OK) return st; // page end

    // Send whole buffer in small chunks
    // (Each oled_write_data prepends control byte 0x40)
    for (int off = 0; off < (int)sizeof(g_fb); ) {
        int chunk = 16;
        if (off + chunk > (int)sizeof(g_fb)) chunk = (int)sizeof(g_fb) - off;
        st = oled_write_data(&g_fb[off], (uint16_t)chunk);
        if (st != HAL_OK) return st;
        off += chunk;
    }
    return HAL_OK;
}
void demo_text() {
    fb_clear();
    fb_draw_text(0, 0, "HELLO WORLD");
    fb_draw_text(0, 8, "T E S T TEST TTT");
    fb_draw_text(0, 16, "1.2:3.4:5.6:7.8:9");
    fb_draw_text(0, 24, "SUCK MY BALLS");
    fb_draw_text(0, 32, "JIA DE");
    oled_flush_full();
}


#define HT16K33_CMD_OSC_ON  0x21
#define HT16K33_CMD_DISPLAY 0x80          // + blink rate << 1 | display on
#define HT16K33_DISPLAY_ON  0x01
#define HT16K33_CMD_DIM     0xE0          // + brightness (0-15)

static inline void HT16K33_Init(uint8_t brightness /* 0..15 */, uint8_t blink /* 0..3 */)
{
    uint8_t cmd;

    cmd = HT16K33_CMD_OSC_ON;
    HAL_I2C_Master_Transmit(&hi2c1, HT16K33_ADDR, &cmd, 1, HAL_MAX_DELAY);

    cmd = HT16K33_CMD_DISPLAY | (blink << 1) | HT16K33_DISPLAY_ON;
    HAL_I2C_Master_Transmit(&hi2c1, HT16K33_ADDR, &cmd, 1, HAL_MAX_DELAY);

    cmd = HT16K33_CMD_DIM | (brightness & 0x0F);
    HAL_I2C_Master_Transmit(&hi2c1, HT16K33_ADDR, &cmd, 1, HAL_MAX_DELAY);
}

// Write an 8x8 frame using 16-bit rows (LSB sent first for each row).
// rows[0] is first row; bit0 = column 0. Only low 8 bits are used by mono 8x8.
static inline HAL_StatusTypeDef HT16K33_WriteRows16(const uint16_t rows[8])
{
    uint8_t buf[1 + 16];
    buf[0] = 0x00; // start at display RAM address 0x00

    for (uint8_t r = 0; r < 8; r++) {
        buf[1 + (r * 2) + 0] = (uint8_t)(rows[r] & 0xFF);
        buf[1 + (r * 2) + 1] = (uint8_t)((rows[r] >> 8) & 0xFF);
    }
    return HAL_I2C_Master_Transmit(&hi2c1, HT16K33_ADDR, buf, sizeof(buf), HAL_MAX_DELAY);
}

// Convenience: write using 8-bit rows (mono 8x8). Each byte is a row bitmap.
static inline HAL_StatusTypeDef HT16K33_WriteRows8(const uint8_t rows[8])
{
    uint8_t buf[1 + 16];
    buf[0] = 0x00; // start at display RAM address 0x00

    for (uint8_t r = 0; r < 8; r++) {
        buf[1 + (r * 2) + 0] = rows[r];  // low byte (columns 0..7)
        buf[1 + (r * 2) + 1] = 0x00;     // high byte (columns 8..15 unused)
    }
    return HAL_I2C_Master_Transmit(&hi2c1, HT16K33_ADDR, buf, sizeof(buf), HAL_MAX_DELAY);
}


// Custom Class for Switching
typedef struct {
	const char *name;
	void (*initialise)(void);
	void (*update)(void);
	void (*exit)(void);
} State;

void Start_initialise();
void Start_update();
void Start_exit();
void End_initialise();
void End_update();
void End_exit();
void RedLightGreenLight_initialise(void);
void RedLightGreenLight_update(void);
void RedLightGreenLight_exit(void);
void CatchAndRun_initialise(void);
void CatchAndRun_update(void);
void CatchAndRun_exit(void);

void Start_initialise() {
    HAL_UART_Transmit(&huart1, (uint8_t*)"Welcome\r\n", sizeof("Welcome\r\n") - 1, 100);
}
void Start_update() {
	// check if NFC
	return;
}
void Start_exit() {
    HAL_UART_Transmit(&huart1, (uint8_t*)"Welcome\r\n", sizeof("Welcome\r\n") - 1, 100);
}
void End_initialise() {
	HAL_UART_Transmit(&huart1, (uint8_t*)"Game Over\r\n", sizeof("Game Over\r\n") - 1, 100);
}
void End_update() {
	// check if NFC3
	}
void End_exit() {
	HAL_UART_Transmit(&huart1, (uint8_t*)"Game Over\r\n", sizeof("Game Over\r\n") - 1, 100);
	programRunning = false;
}
// Implementation for RedLightGreenLight State
void RedLightGreenLight_initialise(void) {
	if (isPlayer) {
	    HAL_UART_Transmit(&huart1, (uint8_t*)"Entering Red Light, Green Light as Player\r\n",
	    		sizeof("Entering Red Light, Green Light as Player\r\n") - 1, 100);
	} else {
	    HAL_UART_Transmit(&huart1, (uint8_t*)"Entering Red Light, Green Light as Enforcer\r\n",
	    		sizeof("Entering Red Light, Green Light as Enforcer\r\n") - 1, 100);
	}
}
void RedLightGreenLight_update(void) {
    static bool init = false;
	static bool isGreen = false;
	uint32_t now = HAL_GetTick();
	static uint32_t next_ms;
	static int countdown = 9;        // start at 9

