kilojoules-kj/EE2028-STM32/Core/Src/main.c
State StartState = {
    .name = "Start",
    .initialise = Start_initialise,
    .update = Start_update,
    .exit = Start_exit
};

State EndState = {
    .name = "End",
    .initialise = End_initialise,
    .update = End_update,
    .exit = End_exit
};

State RedLightGreenLightState = {
    .name = "RedLightGreenLight",
    .initialise = RedLightGreenLight_initialise,
    .update = RedLightGreenLight_update,
    .exit = RedLightGreenLight_exit
};

State CatchAndRunState = {
    .name = "CatchAndRun",
    .initialise = CatchAndRun_initialise,
    .update = CatchAndRun_update,
    .exit = CatchAndRun_exit
};

void toggleState(void) {
	if (currentState == &StartState) {
		currentState->exit();
		currentState = &RedLightGreenLightState;
	} else if (currentState == &RedLightGreenLightState) {
		currentState->exit();
		currentState = &CatchAndRunState;
	} else if (currentState == &CatchAndRunState) {
		currentState->exit();
		currentState = &RedLightGreenLightState;
	}

	currentState->initialise();
}

void endState(void) {
	HAL_UART_Transmit(&huart1, (uint8_t*)"Game Over\r\n", sizeof("Game Over\r\n") - 1, 100);
	programRunning = false;
}


void setup(void) {
	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();
	MX_GPIO_Init(); // GPIO Pins
	/* UART initialization */
	UART1_Init();
	// initialise_monitor_handles(); // for semi-hosting support (printf)

	/* Peripheral initializations using BSP functions */
	BSP_TSENSOR_Init();
	BSP_PSENSOR_Init();
	BSP_HSENSOR_Init();
	BSP_ACCELERO_Init();
	BSP_GYRO_Init();
	BSP_MAGNETO_Init();
	if (BSP_NFCTAG_Init(0) != NFCTAG_OK) {
	    HAL_UART_Transmit(&huart1, (uint8_t*)"NFC Init Failed\r\n", sizeof("NFC Init Failed\r\n") - 1, 100);
	} else {
	    HAL_UART_Transmit(&huart1, (uint8_t*)"NFC Init OK\r\n", sizeof("NFC Init OK\r\n") - 1, 100);
	}

	ST25DV_PASSWD pwd = { .MsbPasswd = 0, .LsbPasswd = 0 };
	(void)BSP_NFCTAG_PresentI2CPassword(0, pwd);   // required for static writes

	// 1) Set GPO pulse width (pick an enum your header defines)
	(void)BSP_NFCTAG_WriteITPulse(0, (ST25DV_PULSE_DURATION)2);

	// 2) Enable only the RF field events you want on GPO
	uint16_t itmask = 0;
	itmask |= NFCTAG_IT_FIELDRISING;   // RF ON
	itmask |= NFCTAG_IT_FIELDFALLING;  // RF OFF (optional)
	(void)BSP_NFCTAG_ConfigIT(0, itmask);

	// 3) Make sure dynamic GPO is enabled
	(void)BSP_NFCTAG_SetGPO_en_Dyn(0);

	// 4) Clear any stale flags so the first pulse comes clean
	uint16_t dummy; (void)BSP_NFCTAG_GetITStatus(0, &dummy);
	uint8_t  dyn;   (void)BSP_NFCTAG_ReadITSTStatus_Dyn(0, &dyn);


	OLED_ON(); // on screen
	oled_clear();
	demo_text();

	// LED MATRIX
	HT16K33_Init(15, 0);
	HT16K33_WriteRows8(led_matrix_frame(-1, LED_SHAPE_NONE)); // clear the LED Matrix

	// SENSOR_IO_Write(0xD4, 0x0D, 0x03); // gyro

	// My state machine
	currentState = &RedLightGreenLightState;
	currentState->initialise();
}



static void nfc_service(void) {
	uint32_t it = g_nfc_it_flags;
	if (!it) return;
	g_nfc_it_flags = 0;

    if (g_nfc_it_flags & NFCTAG_IT_FIELDRISING) {
        uint32_t now = HAL_GetTick();
        if (now - g_nfc_last_report_ms >= 1000) { // 1 s rate-limit
            const char *msg = "RF field ON (phone near)\r\n";
            HAL_UART_Transmit(&huart1, (uint8_t*)msg, (uint16_t)strlen(msg), 100);
            g_nfc_last_report_ms = now;
        }
    }
}

// Main Program Code
int main(void) {
	setup();

  	while (programRunning) {
  		nfc_service();
  		currentState->update();
	}
}
